package p230106데이터베이스ㄱ;

public class a01개념 {
	/* 데이터베이스
	 * dbms
	 * 데이터베이스의 종류
	 * 
	 * 1. 관계형 데이터베이스
	 * SQL, 쿼리, 스키마
	 * 
	 * 
	 * name age address
	 * 홍길동 30  서울
	 * 강호동 50  인천
	 * 유재석 40  경기
	 * 등등등
	 * 
	 * 
	 * 컬럼(세로) = name, age, address
	 * 레코드(가로) = 한 줄
	 * 데이터들이 다수의 테이블로 구성
	 * 각 테이블은 key와 value들의 관계로 표현
	 * key = name
	 * value = 홍길동
	 * 조인 = 서로 다른 테이블간에 공통된 이름의 열이 포함될 경우 관계가 성립
	 * 대부분의 데이터베이스는 관계형 데이터베이스
	 * 
	 * 
	 * 2. 객체 지향 데이터베이스 = 오브젝트 데이터베이스
	 * 정보를 객체의 형태로 표현.
	 * 검색한 결과가 객체로 리턴됨
	 * 
	 * MySQL
	 */

}
