package p1209상속ㄱ;

public class a01클래스와객체 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		/* new랑 붙어있던거
		 * 세상 모든것이 객체(object)
		 * 객체(object) = 변수+메소드
		 * ex) 사람이라는 객체의 state(나이, 키, 몸무게, 이름 등은)
		 * 객체의 행동 = 메소드(eat, speak, run 등)
		 * 
		 * 캡슐화
		 * 객체를 싸서 내부를 볼 수 없게 하는것
		 * 사용자는 내부구조 알 필요 없고 호출해서 쓰기만 해라
		 * 
		 * 클래스 = 객체 모양을 선언한 [틀](캡슐화)
		 * 하나의 클래스로 관련있는 여러개의 객체를 생성 가능
		 * 객체 = [클래스의 모양대로] 구체화한 실체
		 * ex) 자동차 생산기계라는 틀은 여러종류의 자동차를 만들 수 있다
		 * 
		 * 상속 = 상위개체의 속성이 하위개체에 물려짐
		 * 상위객체 = 슈퍼, 부모
		 * 하위객체 = 서브, 자녀
		 * ex) 생물=상위객체 / 동물,식물=하위객체
		 * 상위객체는 하위객체의 특성을 모두 포함하지만, 하위객체는 상위객체릐 특성의 일부만 가지고 있다
		 * 하위클래스는 상속받은 특성 외에 본인만의 특성도 추가 가능
		 * 
		 * 다형성 = 같은 이름의 메소드가 클래스나 객체에 따라 다르게 동작하도록 구현
		 * 메소드 오버로딩 : [같은 이름이지만 다르게 작동] 하는 여러 메소드
		 * ex) 똑같은 sort메소드에도 다양한 종류가 있다
		 * 메소드 오버라이딩 : [슈퍼클래스의 메소드를 서브클래스마다 다르게] 구현
		 * ex) animal - speak - dog(멍멍)
		 *                    - cat(야옹)
		 *                    - chicken(꼬꼬댁)
		 * 
		 */

	}

}
